## Terraform Plan For Approval :

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


  Acquiring state lock. This may take a few moments...
module.mcmp.mongodbatlas_project.project[0]: Refreshing state... [id=613101cfd815c50a4a8ca9f5]
module.mcmp.ec_deployment.elastic_cloud["aiops"]: Refreshing state... [id=cf3705c15072d3b515c1db14299fdf52]
module.mcmp.ec_deployment_traffic_filter.traffic_filter[0]: Refreshing state... [id=39d19ba8eaa94599accca244c47d9f5e]
module.mcmp.mongodbatlas_database_user.database["coreplus"]: Refreshing state... [id=YXV0aF9kYXRhYmFzZV9uYW1l:YWRtaW4=-cHJvamVjdF9pZA==:NjEzMTAxY2ZkODE1YzUwYTRhOGNhOWY1-dXNlcm5hbWU=:Y29yZXBsdXNkYkFkbWlu]
module.mcmp.mongodbatlas_custom_dns_configuration_cluster_aws.project[0]: Refreshing state... [id=613101cfd815c50a4a8ca9f5]
module.mcmp.mongodbatlas_database_user.database["corelite"]: Refreshing state... [id=YXV0aF9kYXRhYmFzZV9uYW1l:YWRtaW4=-cHJvamVjdF9pZA==:NjEzMTAxY2ZkODE1YzUwYTRhOGNhOWY1-dXNlcm5hbWU=:Y29yZWxpdGVkYkFkbWlu]
module.mcmp.aws_vpc_endpoint.elastic_cloud[0]: Refreshing state... [id=vpce-0df48f07cdb142f99]
module.mcmp.aws_route53_record.elastic_cloud_service[0]: Refreshing state... [id=Z09876311FPNXL9PX7FX1_*.vpce.ap-south-1.aws.elastic-cloud.com_CNAME]
module.mcmp.aws_route53_zone.internal[0]: Refreshing state... [id=Z09876311FPNXL9PX7FX1]
module.mcmp.aws_iam_group.viewer: Refreshing state... [id=mumbai-dev-39e419-k8sViewer]
module.mcmp.aws_iam_role.eks: Refreshing state... [id=mumbai-dev-39e419-EKSClusterRole]
module.mcmp.aws_vpc.main: Refreshing state... [id=vpc-07f0c6cefa97a3d8d]
module.mcmp.aws_cloudwatch_log_group.log_group["actions"]: Refreshing state... [id=mumbai-dev-39e419-actions-LogGroup]
module.mcmp.aws_iam_policy.policy: Refreshing state... [id=arn:aws:iam::794296633202:policy/mumbai-dev-39e419-AWSLoadBalancerControllerIAMPolicy]
module.mcmp.aws_cloudwatch_log_group.log_group["consume"]: Refreshing state... [id=mumbai-dev-39e419-consume-LogGroup]
module.mcmp.aws_cloudwatch_log_group.log_group["coreplus"]: Refreshing state... [id=mumbai-dev-39e419-coreplus-LogGroup]
module.mcmp.aws_iam_group.admin: Refreshing state... [id=mumbai-dev-39e419-k8sAdmin]
module.mcmp.aws_s3_bucket.s3["mcmp"]: Refreshing state... [id=mumbai-dev-39e419-mcmp]
module.mcmp.aws_s3_bucket.s3["vault"]: Refreshing state... [id=mumbai-dev-39e419-vault]
module.mcmp.aws_iam_role.nodes: Refreshing state... [id=mumbai-dev-39e419-EKSNodeRole]
module.mcmp.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:ap-south-1:794296633202:certificate/67451dc9-9611-44a8-adfb-ac9d9723f553]
module.mcmp.aws_iam_policy.cluster_autoscaler: Refreshing state... [id=arn:aws:iam::794296633202:policy/mumbai-dev-39e419-AmazonEKSClusterAutoscalerPolicy]
module.mcmp.aws_iam_role.viewer: Refreshing state... [id=mumbai-dev-39e419-k8sViewer]
module.mcmp.aws_iam_role.admin: Refreshing state... [id=mumbai-dev-39e419-k8sAdmin]
module.mcmp.aws_iam_role_policy_attachment.eks_service: Refreshing state... [id=mumbai-dev-39e419-EKSClusterRole-20210902165452814700000005]
module.mcmp.aws_iam_role_policy_attachment.eks_vpc: Refreshing state... [id=mumbai-dev-39e419-EKSClusterRole-20210902165454230100000007]
module.mcmp.aws_iam_role_policy_attachment.eks: Refreshing state... [id=mumbai-dev-39e419-EKSClusterRole-20210902165452949300000006]
module.mcmp.aws_iam_policy.view_eks_clusters: Refreshing state... [id=arn:aws:iam::794296633202:policy/mumbai-dev-39e419-AmazonEKSClusterViewPolicy]
module.mcmp.aws_iam_role_policy_attachment.nodes: Refreshing state... [id=mumbai-dev-39e419-EKSNodeRole-20210902165447315100000003]
module.mcmp.aws_iam_role_policy_attachment.nodes_cni: Refreshing state... [id=mumbai-dev-39e419-EKSNodeRole-20210902165447202600000002]
module.mcmp.aws_iam_role_policy_attachment.nodes_ecr: Refreshing state... [id=mumbai-dev-39e419-EKSNodeRole-20210902165447971300000004]
module.mcmp.aws_iam_policy.viewer: Refreshing state... [id=arn:aws:iam::794296633202:policy/mumbai-dev-39e419-k8sViewer]
module.mcmp.aws_iam_policy.admin: Refreshing state... [id=arn:aws:iam::794296633202:policy/mumbai-dev-39e419-k8sAdmin]
module.mcmp.aws_iam_role_policy_attachment.viewer: Refreshing state... [id=mumbai-dev-39e419-k8sViewer-20210902165501190700000008]
module.mcmp.aws_iam_role_policy_attachment.admin: Refreshing state... [id=mumbai-dev-39e419-k8sAdmin-20210902165501273600000009]
module.mcmp.aws_iam_group_policy_attachment.viewer: Refreshing state... [id=mumbai-dev-39e419-k8sViewer-2021090216552249280000000a]
module.mcmp.aws_iam_group_policy_attachment.admin: Refreshing state... [id=mumbai-dev-39e419-k8sAdmin-2021090216552261530000000b]
module.mcmp.aws_security_group.main: Refreshing state... [id=sg-0e0f17d8e1a44e39c]
module.mcmp.aws_subnet.public[1]: Refreshing state... [id=subnet-0616185cc57a2e83e]
module.mcmp.aws_route_table.public: Refreshing state... [id=rtb-0b191e2b2840ce926]
module.mcmp.aws_subnet.public[0]: Refreshing state... [id=subnet-05e50110900d875b5]
module.mcmp.aws_subnet.public[2]: Refreshing state... [id=subnet-010d6b7a25c1ff310]
module.mcmp.aws_subnet.private[1]: Refreshing state... [id=subnet-03eb2fde44b98cc37]
module.mcmp.mongodbatlas_cluster.cluster["coreplus"]: Refreshing state... [id=Y2x1c3Rlcl9pZA==:NjEzMTAxZDc5NTllNjM3ZWFjNzc3N2Y1-Y2x1c3Rlcl9uYW1l:bXVtYmFpLWRldi0zOWU0MTktY29yZXBsdXMtZ2xvYmFs-cHJvamVjdF9pZA==:NjEzMTAxY2ZkODE1YzUwYTRhOGNhOWY1-cHJvdmlkZXJfbmFtZQ==:QVdT]
module.mcmp.mongodbatlas_cluster.cluster["corelite"]: Refreshing state... [id=Y2x1c3Rlcl9pZA==:NjEzMTAxZDg4YjA1YWExZjc4OTk4NDU1-Y2x1c3Rlcl9uYW1l:bXVtYmFpLWRldi0zOWU0MTktY29yZWxpdGUtZ2xvYmFs-cHJvamVjdF9pZA==:NjEzMTAxY2ZkODE1YzUwYTRhOGNhOWY1-cHJvdmlkZXJfbmFtZQ==:QVdT]
module.mcmp.aws_internet_gateway.public: Refreshing state... [id=igw-06939e57a30b46bda]
module.mcmp.aws_subnet.private[2]: Refreshing state... [id=subnet-079db3507641448dc]
module.mcmp.aws_subnet.private[0]: Refreshing state... [id=subnet-07c0466c8c8aa7cfd]
module.mcmp.aws_route_table.private: Refreshing state... [id=rtb-0d75bd82fc118880f]
module.mcmp.mongodbatlas_network_peering.vpc_peering[0]: Refreshing state... [id=cGVlcl9pZA==:NjEzMTAzZWMzM2I0MGYzMzIxNTVmN2I5-cHJvamVjdF9pZA==:NjEzMTAxY2ZkODE1YzUwYTRhOGNhOWY1-cHJvdmlkZXJfbmFtZQ==:QVdT]
module.mcmp.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-004912cd0207db064]
module.mcmp.aws_eks_cluster.main: Refreshing state... [id=mumbai-dev-39e419]
module.mcmp.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-00b0830520f4d08d9]
module.mcmp.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0a0cd9dd77a87e7e5]
module.mcmp.mongodbatlas_project_ip_access_list.cidr_block[0]: Refreshing state... [id=ZW50cnk=:MTcyLjE2LjAuMC8xNg==-cHJvamVjdF9pZA==:NjEzMTAxY2ZkODE1YzUwYTRhOGNhOWY1]
module.mcmp.aws_eip.private: Refreshing state... [id=eipalloc-010973d505279ce5a]
module.mcmp.aws_route.public: Refreshing state... [id=r-rtb-0b191e2b2840ce9261080289494]
module.mcmp.aws_vpc_peering_connection_accepter.peer[0]: Refreshing state... [id=pcx-0bf3171321887dd20]
module.mcmp.aws_elasticache_subnet_group.group[0]: Refreshing state... [id=mumbai-dev-39e419-elasticachesubnetgroup]
module.mcmp.aws_route.peer[0]: Refreshing state... [id=r-rtb-0d75bd82fc118880f116581087]
module.mcmp.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0d97391393e0d6b28]
module.mcmp.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0410cade8d74caab8]
module.mcmp.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0d5009b096f95a78c]
module.mcmp.aws_iam_role.alb: Refreshing state... [id=mumbai-dev-39e419-AmazonEKSLoadBalancerControllerRole]
module.mcmp.aws_iam_openid_connect_provider.main: Refreshing state... [id=arn:aws:iam::794296633202:oidc-provider/oidc.eks.ap-south-1.amazonaws.com/id/AA735B22AFCA2C5FF0F5E4E9E287DB02]
module.mcmp.aws_nat_gateway.private: Refreshing state... [id=nat-0f0fba49348068898]
module.mcmp.module.cloudamqp["actions"].cloudamqp_instance.instance: Refreshing state... [id=140214]
module.mcmp.module.cloudamqp["coreplus"].cloudamqp_instance.instance: Refreshing state... [id=140227]
module.mcmp.aws_iam_role.cluster_autoscaler: Refreshing state... [id=mumbai-dev-39e419-AmazonEKSClusterAutoscalerRole]
module.mcmp.aws_iam_policy_attachment.alb: Refreshing state... [id=mumbai-dev-39e419-alb]
module.mcmp.module.cloudamqp["coreplus"].cloudamqp_security_firewall.firewall_settings: Refreshing state... [id=140227]
module.mcmp.module.cloudamqp["actions"].cloudamqp_integration_metric.cloudwatch_metric[0]: Refreshing state... [id=9371]
module.mcmp.module.cloudamqp["coreplus"].cloudamqp_integration_metric.cloudwatch_metric[0]: Refreshing state... [id=9372]
module.mcmp.module.cloudamqp["actions"].cloudamqp_security_firewall.firewall_settings: Refreshing state... [id=140214]
module.mcmp.module.cloudamqp["coreplus"].cloudamqp_plugin.plugin_rabbitmq_amqp1_0: Refreshing state... [id=rabbitmq_amqp1_0]
module.mcmp.module.cloudamqp["coreplus"].cloudamqp_integration_log.cloudwatch_log[0]: Refreshing state... [id=5425]
module.mcmp.module.cloudamqp["actions"].cloudamqp_plugin.plugin_rabbitmq_amqp1_0: Refreshing state... [id=rabbitmq_amqp1_0]
module.mcmp.module.cloudamqp["actions"].cloudamqp_integration_log.cloudwatch_log[0]: Refreshing state... [id=5426]
module.mcmp.module.cloudamqp["coreplus"].cloudamqp_notification.recipient: Refreshing state... [id=131602]
module.mcmp.module.cloudamqp["actions"].cloudamqp_notification.recipient: Refreshing state... [id=131601]
module.mcmp.aws_iam_role_policy_attachment.cluster_autoscaler: Refreshing state... [id=mumbai-dev-39e419-AmazonEKSClusterAutoscalerRole-20210903164401420000000002]
module.mcmp.module.cloudamqp["actions"].cloudamqp_alarm.disk_alarm: Refreshing state... [id=200298]
module.mcmp.module.cloudamqp["coreplus"].cloudamqp_alarm.cpu_alarm: Refreshing state... [id=200301]
module.mcmp.module.cloudamqp["coreplus"].cloudamqp_alarm.disk_alarm: Refreshing state... [id=200302]
module.mcmp.module.cloudamqp["actions"].cloudamqp_alarm.cpu_alarm: Refreshing state... [id=200297]
module.mcmp.module.cloudamqp["coreplus"].cloudamqp_alarm.memory_alarm: Refreshing state... [id=200300]
module.mcmp.module.cloudamqp["actions"].cloudamqp_alarm.memory_alarm: Refreshing state... [id=200299]
module.mcmp.aws_route.private: Refreshing state... [id=r-rtb-0d75bd82fc118880f1080289494]
module.mcmp.aws_elasticache_replication_group.redis["consume"]: Refreshing state... [id=mumbai-dev-39e419-consume-redis]
module.mcmp.aws_elasticache_replication_group.redis["actions"]: Refreshing state... [id=mumbai-dev-39e419-actions-redis]
module.mcmp.aws_elasticache_replication_group.redis["coreplus"]: Refreshing state... [id=mumbai-dev-39e419-coreplus-redis]
module.mcmp.module.cloudamqp["coreplus"].null_resource.rabbimq_config_exec: Refreshing state... [id=3929871712049807212]
module.mcmp.module.cloudamqp["actions"].null_resource.rabbimq_config_exec: Refreshing state... [id=613664207817831307]
module.mcmp.kubernetes_service_account.alb: Refreshing state... [id=kube-system/aws-load-balancer-controller]
module.mcmp.kubernetes_role_binding.cluster_autoscaler: Refreshing state... [id=kube-system/cluster-autoscaler]
module.mcmp.kubernetes_cluster_role.cluster_autoscaler: Refreshing state... [id=cluster-autoscaler]
module.mcmp.kubernetes_service_account.cluster_autoscaler: Refreshing state... [id=kube-system/cluster-autoscaler]
module.mcmp.kubernetes_role.cluster_autoscaler: Refreshing state... [id=kube-system/cluster-autoscaler]
module.mcmp.kubernetes_cluster_role_binding.cluster_autoscaler: Refreshing state... [id=cluster-autoscaler]
module.mcmp.kubernetes_cluster_role_binding.viewer: Refreshing state... [id=cluster-viewer]
module.mcmp.module.cloudamqp["actions"].aws_vpc_peering_connection.aws_vpc_peering[0]: Refreshing state... [id=pcx-0e968030d4e01fa20]
module.mcmp.module.cloudamqp["coreplus"].aws_vpc_peering_connection.aws_vpc_peering[0]: Refreshing state... [id=pcx-00e0733b8eef7c646]
module.mcmp.kubernetes_config_map.aws_auth: Refreshing state... [id=kube-system/aws-auth]
module.mcmp.aws_eks_node_group.main["default"]: Refreshing state... [id=mumbai-dev-39e419:default]
module.mcmp.module.cloudamqp["coreplus"].cloudamqp_vpc_peering.vpc_accept_peering[0]: Refreshing state... [id=pcx-00e0733b8eef7c646]
module.mcmp.module.cloudamqp["actions"].cloudamqp_vpc_peering.vpc_accept_peering[0]: Refreshing state... [id=pcx-0e968030d4e01fa20]
module.mcmp.module.cloudamqp["actions"].aws_route.accepter_route[0]: Refreshing state... [id=r-rtb-0d75bd82fc118880f4277253910]
module.mcmp.module.cloudamqp["coreplus"].aws_route.accepter_route[0]: Refreshing state... [id=r-rtb-0d75bd82fc118880f900555955]
module.mcmp.module.cloudamqp["actions"].cloudamqp_plugin.plugin_rabbitmq_auth_backend_cache: Refreshing state... [id=rabbitmq_auth_backend_cache]
module.mcmp.module.cloudamqp["coreplus"].cloudamqp_plugin.plugin_rabbitmq_auth_backend_cache: Refreshing state... [id=rabbitmq_auth_backend_cache]
module.mcmp.helm_release.alb: Refreshing state... [id=alb]
module.mcmp.kubernetes_deployment.cluster_autoscaler: Refreshing state... [id=kube-system/cluster-autoscaler]
module.mcmp.module.cloudamqp["actions"].aws_vpc_peering_connection_options.aws_vpc_peering_options[0]: Refreshing state... [id=pcx-0e968030d4e01fa20]
module.mcmp.module.cloudamqp["coreplus"].aws_vpc_peering_connection_options.aws_vpc_peering_options[0]: Refreshing state... [id=pcx-00e0733b8eef7c646]
module.mcmp.module.cloudamqp["coreplus"].cloudamqp_plugin.plugin_rabbitmq_auth_backend_http: Refreshing state... [id=rabbitmq_auth_backend_http]
module.mcmp.module.cloudamqp["actions"].cloudamqp_plugin.plugin_rabbitmq_auth_backend_http: Refreshing state... [id=rabbitmq_auth_backend_http]
module.mcmp.module.cloudamqp["coreplus"].cloudamqp_plugin.plugin_rabbitmq_auth_mechanism_ssl: Refreshing state... [id=rabbitmq_auth_mechanism_ssl]
module.mcmp.module.cloudamqp["actions"].cloudamqp_plugin.plugin_rabbitmq_auth_mechanism_ssl: Refreshing state... [id=rabbitmq_auth_mechanism_ssl]
module.mcmp.module.cloudamqp["coreplus"].cloudamqp_plugin.plugin_rabbitmq_mqtt: Refreshing state... [id=rabbitmq_mqtt]
module.mcmp.module.cloudamqp["actions"].cloudamqp_plugin.plugin_rabbitmq_mqtt: Refreshing state... [id=rabbitmq_mqtt]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.mcmp.module.cloudamqp["actions"].aws_route.accepter_route[0] has been changed
  ~ resource "aws_route" "accepter_route" {
        id                        = "r-rtb-0d75bd82fc118880f4277253910"
      ~ state                     = "blackhole" -> "active"
        # (4 unchanged attributes hidden)
    }
  # module.mcmp.module.cloudamqp["actions"].aws_vpc_peering_connection.aws_vpc_peering[0] has been changed
  ~ resource "aws_vpc_peering_connection" "aws_vpc_peering" {
      ~ accept_status = "pending-acceptance" -> "active"
        id            = "pcx-0e968030d4e01fa20"
        tags          = {
            "Name" = "mumbai-dev-39e419-actions-cloudamqp"
        }
        # (5 unchanged attributes hidden)

      ~ requester {
          ~ allow_remote_vpc_dns_resolution  = false -> true
            # (2 unchanged attributes hidden)
        }
    }
  # module.mcmp.module.cloudamqp["coreplus"].aws_route.accepter_route[0] has been changed
  ~ resource "aws_route" "accepter_route" {
        id                        = "r-rtb-0d75bd82fc118880f900555955"
      ~ state                     = "blackhole" -> "active"
        # (4 unchanged attributes hidden)
    }
  # module.mcmp.module.cloudamqp["coreplus"].aws_vpc_peering_connection.aws_vpc_peering[0] has been changed
  ~ resource "aws_vpc_peering_connection" "aws_vpc_peering" {
      ~ accept_status = "pending-acceptance" -> "active"
        id            = "pcx-00e0733b8eef7c646"
        tags          = {
            "Name" = "mumbai-dev-39e419-coreplus-cloudamqp"
        }
        # (5 unchanged attributes hidden)

      ~ requester {
          ~ allow_remote_vpc_dns_resolution  = false -> true
            # (2 unchanged attributes hidden)
        }
    }
  # module.mcmp.kubernetes_deployment.cluster_autoscaler has been changed
  ~ resource "kubernetes_deployment" "cluster_autoscaler" {
        id               = "kube-system/cluster-autoscaler"
        # (1 unchanged attribute hidden)


      ~ spec {
            # (5 unchanged attributes hidden)



          ~ template {

              ~ spec {
                  + node_selector                    = {}
                    # (11 unchanged attributes hidden)

                  ~ container {
                      + args                       = []
                        name                       = "cluster-autoscaler"
                        # (8 unchanged attributes hidden)


                        # (2 unchanged blocks hidden)
                    }

                    # (1 unchanged block hidden)
                }
                # (1 unchanged block hidden)
            }
            # (2 unchanged blocks hidden)
        }
        # (1 unchanged block hidden)
    }
  # module.mcmp.kubernetes_cluster_role.cluster_autoscaler has been changed
  ~ resource "kubernetes_cluster_role" "cluster_autoscaler" {
        id = "cluster-autoscaler"

      ~ metadata {
          + annotations      = {}
            name             = "cluster-autoscaler"
            # (4 unchanged attributes hidden)
        }

      ~ rule {
          + non_resource_urls = []
          + resource_names    = []
            # (3 unchanged attributes hidden)
        }
      ~ rule {
          + non_resource_urls = []
          + resource_names    = []
            # (3 unchanged attributes hidden)
        }
      ~ rule {
          + non_resource_urls = []
          + resource_names    = []
            # (3 unchanged attributes hidden)
        }
      ~ rule {
          + non_resource_urls = []
            # (4 unchanged attributes hidden)
        }
      ~ rule {
          + non_resource_urls = []
          + resource_names    = []
            # (3 unchanged attributes hidden)
        }
      ~ rule {
          + non_resource_urls = []
          + resource_names    = []
            # (3 unchanged attributes hidden)
        }
      ~ rule {
          + non_resource_urls = []
          + resource_names    = []
            # (3 unchanged attributes hidden)
        }
      ~ rule {
          + non_resource_urls = []
          + resource_names    = []
            # (3 unchanged attributes hidden)
        }
      ~ rule {
          + non_resource_urls = []
          + resource_names    = []
            # (3 unchanged attributes hidden)
        }
      ~ rule {
          + non_resource_urls = []
          + resource_names    = []
            # (3 unchanged attributes hidden)
        }
      ~ rule {
          + non_resource_urls = []
          + resource_names    = []
            # (3 unchanged attributes hidden)
        }
      ~ rule {
          + non_resource_urls = []
          + resource_names    = []
            # (3 unchanged attributes hidden)
        }
      ~ rule {
          + non_resource_urls = []
            # (4 unchanged attributes hidden)
        }
    }
  # module.mcmp.kubernetes_cluster_role_binding.cluster_autoscaler has been changed
  ~ resource "kubernetes_cluster_role_binding" "cluster_autoscaler" {
        id = "cluster-autoscaler"

      ~ metadata {
          + annotations      = {}
            name             = "cluster-autoscaler"
            # (4 unchanged attributes hidden)
        }


        # (2 unchanged blocks hidden)
    }
  # module.mcmp.kubernetes_role_binding.cluster_autoscaler has been changed
  ~ resource "kubernetes_role_binding" "cluster_autoscaler" {
        id = "kube-system/cluster-autoscaler"

      ~ metadata {
          + annotations      = {}
            name             = "cluster-autoscaler"
            # (5 unchanged attributes hidden)
        }


        # (2 unchanged blocks hidden)
    }
  # module.mcmp.kubernetes_config_map.aws_auth has been changed
  ~ resource "kubernetes_config_map" "aws_auth" {
      + binary_data = {}
        id          = "kube-system/aws-auth"
        # (1 unchanged attribute hidden)

      ~ metadata {
          + annotations      = {}
            name             = "aws-auth"
            # (5 unchanged attributes hidden)
        }
    }
  # module.mcmp.kubernetes_cluster_role_binding.viewer has been changed
  ~ resource "kubernetes_cluster_role_binding" "viewer" {
        id = "cluster-viewer"

      ~ metadata {
          + annotations      = {}
            name             = "cluster-viewer"
            # (4 unchanged attributes hidden)
        }


        # (2 unchanged blocks hidden)
    }
  # module.mcmp.aws_iam_openid_connect_provider.main has been changed
  ~ resource "aws_iam_openid_connect_provider" "main" {
        id              = "arn:aws:iam::794296633202:oidc-provider/oidc.eks.ap-south-1.amazonaws.com/id/AA735B22AFCA2C5FF0F5E4E9E287DB02"
      + tags            = {}
        # (5 unchanged attributes hidden)
    }
  # module.mcmp.kubernetes_role.cluster_autoscaler has been changed
  ~ resource "kubernetes_role" "cluster_autoscaler" {
        id = "kube-system/cluster-autoscaler"

      ~ metadata {
          + annotations      = {}
            name             = "cluster-autoscaler"
            # (5 unchanged attributes hidden)
        }

      ~ rule {
          + resource_names = []
            # (3 unchanged attributes hidden)
        }
        # (1 unchanged block hidden)
    }
  # module.mcmp.aws_iam_role.cluster_autoscaler has been changed
  ~ resource "aws_iam_role" "cluster_autoscaler" {
        id                    = "mumbai-dev-39e419-AmazonEKSClusterAutoscalerRole"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::794296633202:policy/mumbai-dev-39e419-AmazonEKSClusterAutoscalerPolicy",
        ]
        name                  = "mumbai-dev-39e419-AmazonEKSClusterAutoscalerRole"
        tags                  = {
            "Environment"      = "dev"
            "environment_type" = "dev"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.mcmp.aws_iam_role.alb has been changed
  ~ resource "aws_iam_role" "alb" {
        id                    = "mumbai-dev-39e419-AmazonEKSLoadBalancerControllerRole"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::794296633202:policy/mumbai-dev-39e419-AWSLoadBalancerControllerIAMPolicy",
        ]
        name                  = "mumbai-dev-39e419-AmazonEKSLoadBalancerControllerRole"
        tags                  = {
            "Environment"      = "dev"
            "environment_type" = "dev"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.mcmp.aws_iam_policy_attachment.alb has been changed
  ~ resource "aws_iam_policy_attachment" "alb" {
      + groups     = []
        id         = "mumbai-dev-39e419-alb"
        name       = "mumbai-dev-39e419-alb"
      + users      = []
        # (2 unchanged attributes hidden)
    }
  # module.mcmp.aws_route53_record.elastic_cloud_service[0] has been changed
  ~ resource "aws_route53_record" "elastic_cloud_service" {
        id      = "Z09876311FPNXL9PX7FX1_*.vpce.ap-south-1.aws.elastic-cloud.com_CNAME"
        name    = "*.vpce.ap-south-1.aws.elastic-cloud.com"
        # (5 unchanged attributes hidden)
    }
  # module.mcmp.mongodbatlas_cluster.cluster["corelite"] has been changed
  ~ resource "mongodbatlas_cluster" "cluster" {
      ~ connection_strings                      = [
          ~ {
              ~ private              = "" -> "mongodb://mumbai-dev-39e419-corel-shard-00-00-pri.hk4uz.mongodb.net:27017,mumbai-dev-39e419-corel-shard-00-01-pri.hk4uz.mongodb.net:27017,mumbai-dev-39e419-corel-shard-00-02-pri.hk4uz.mongodb.net:27017/?ssl=true&authSource=admin&replicaSet=atlas-3ysp17-shard-0"
              ~ private_srv          = "" -> "mongodb+srv://mumbai-dev-39e419-corel-pri.hk4uz.mongodb.net"
                # (5 unchanged elements hidden)
            },
        ]
        id                                      = "Y2x1c3Rlcl9pZA==:NjEzMTAxZDg4YjA1YWExZjc4OTk4NDU1-Y2x1c3Rlcl9uYW1l:bXVtYmFpLWRldi0zOWU0MTktY29yZWxpdGUtZ2xvYmFs-cHJvamVjdF9pZA==:NjEzMTAxY2ZkODE1YzUwYTRhOGNhOWY1-cHJvdmlkZXJfbmFtZQ==:QVdT"
        name                                    = "mumbai-dev-39e419-corelite-global"
      ~ snapshot_backup_policy                  = [
          ~ {
              ~ next_snapshot            = "2021-09-03T17:03:40Z" -> "2021-09-04T11:03:42Z"
                # (7 unchanged elements hidden)
            },
        ]
        # (28 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }
  # module.mcmp.mongodbatlas_cluster.cluster["coreplus"] has been changed
  ~ resource "mongodbatlas_cluster" "cluster" {
      ~ connection_strings                      = [
          ~ {
              ~ private              = "" -> "mongodb://mumbai-dev-39e419-corep-shard-00-00-pri.hk4uz.mongodb.net:27017,mumbai-dev-39e419-corep-shard-00-01-pri.hk4uz.mongodb.net:27017,mumbai-dev-39e419-corep-shard-00-02-pri.hk4uz.mongodb.net:27017/?ssl=true&authSource=admin&replicaSet=atlas-vohxtz-shard-0"
              ~ private_srv          = "" -> "mongodb+srv://mumbai-dev-39e419-corep-pri.hk4uz.mongodb.net"
                # (5 unchanged elements hidden)
            },
        ]
        id                                      = "Y2x1c3Rlcl9pZA==:NjEzMTAxZDc5NTllNjM3ZWFjNzc3N2Y1-Y2x1c3Rlcl9uYW1l:bXVtYmFpLWRldi0zOWU0MTktY29yZXBsdXMtZ2xvYmFs-cHJvamVjdF9pZA==:NjEzMTAxY2ZkODE1YzUwYTRhOGNhOWY1-cHJvdmlkZXJfbmFtZQ==:QVdT"
        name                                    = "mumbai-dev-39e419-coreplus-global"
      ~ snapshot_backup_policy                  = [
          ~ {
              ~ next_snapshot            = "2021-09-03T17:02:44Z" -> "2021-09-04T11:02:47Z"
                # (7 unchanged elements hidden)
            },
        ]
        # (28 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }
  # module.mcmp.aws_route_table.private has been changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0d75bd82fc118880f"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "10.40.74.0/24"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = "pcx-00e0733b8eef7c646"
            },
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "10.40.74.0/24"
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = "pcx-0aec1af2681736a9e"
            },
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "10.40.75.0/24"
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = "pcx-05964b8ea95c5b829"
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "10.40.75.0/24"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = "pcx-0e968030d4e01fa20"
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "192.168.248.0/21"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = "pcx-0bf3171321887dd20"
            },
            # (1 unchanged element hidden)
        ]
        tags             = {
            "Environment"      = "dev"
            "Name"             = "mumbai-dev-39e419-private"
            "environment_type" = "dev"
        }
        # (5 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.mcmp.aws_route53_record.elastic_cloud_service[0] will be destroyed
  - resource "aws_route53_record" "elastic_cloud_service" {
      - fqdn    = "*.vpce.ap-south-1.aws.elastic-cloud.com" -> null
      - id      = "Z09876311FPNXL9PX7FX1_*.vpce.ap-south-1.aws.elastic-cloud.com_CNAME" -> null
      - name    = "*.vpce.ap-south-1.aws.elastic-cloud.com" -> null
      - records = [
          - "vpce-0df48f07cdb142f99-675zinbn.vpce-svc-0e9c1ae5caa269d1b.ap-south-1.vpce.amazonaws.com",
        ] -> null
      - ttl     = 300 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z09876311FPNXL9PX7FX1" -> null
    }

  # module.mcmp.aws_route53_zone.internal[0] will be destroyed
  - resource "aws_route53_zone" "internal" {
      - comment       = "Managed by Terraform" -> null
      - force_destroy = false -> null
      - id            = "Z09876311FPNXL9PX7FX1" -> null
      - name          = "vpce.ap-south-1.aws.elastic-cloud.com" -> null
      - name_servers  = [
          - "ns-0.awsdns-00.com.",
          - "ns-1024.awsdns-00.org.",
          - "ns-1536.awsdns-00.co.uk.",
          - "ns-512.awsdns-00.net.",
        ] -> null
      - tags          = {} -> null
      - tags_all      = {} -> null
      - zone_id       = "Z09876311FPNXL9PX7FX1" -> null

      - vpc {
          - vpc_id     = "vpc-07f0c6cefa97a3d8d" -> null
          - vpc_region = "ap-south-1" -> null
        }
    }

  # module.mcmp.aws_vpc_endpoint.elastic_cloud[0] will be destroyed
  - resource "aws_vpc_endpoint" "elastic_cloud" {
      - arn                   = "arn:aws:ec2:ap-south-1:794296633202:vpc-endpoint/vpce-0df48f07cdb142f99" -> null
      - cidr_blocks           = [] -> null
      - dns_entry             = [
          - {
              - dns_name       = "vpce-0df48f07cdb142f99-675zinbn.vpce-svc-0e9c1ae5caa269d1b.ap-south-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z2KVTB3ZLFM7JR"
            },
          - {
              - dns_name       = "vpce-0df48f07cdb142f99-675zinbn-ap-south-1a.vpce-svc-0e9c1ae5caa269d1b.ap-south-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z2KVTB3ZLFM7JR"
            },
          - {
              - dns_name       = "vpce-0df48f07cdb142f99-675zinbn-ap-south-1b.vpce-svc-0e9c1ae5caa269d1b.ap-south-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z2KVTB3ZLFM7JR"
            },
          - {
              - dns_name       = "vpce-0df48f07cdb142f99-675zinbn-ap-south-1c.vpce-svc-0e9c1ae5caa269d1b.ap-south-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z2KVTB3ZLFM7JR"
            },
        ] -> null
      - id                    = "vpce-0df48f07cdb142f99" -> null
      - network_interface_ids = [
          - "eni-00043accda64b6191",
          - "eni-02220422038e69e29",
          - "eni-06b2aadd3e7ef0e51",
        ] -> null
      - owner_id              = "794296633202" -> null
      - policy                = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "*"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "*"
                    },
                ]
            }
        ) -> null
      - private_dns_enabled   = false -> null
      - requester_managed     = false -> null
      - route_table_ids       = [] -> null
      - security_group_ids    = [
          - "sg-0e0f17d8e1a44e39c",
        ] -> null
      - service_name          = "com.amazonaws.vpce.ap-south-1.vpce-svc-0e9c1ae5caa269d1b" -> null
      - state                 = "available" -> null
      - subnet_ids            = [
          - "subnet-010d6b7a25c1ff310",
          - "subnet-05e50110900d875b5",
          - "subnet-0616185cc57a2e83e",
        ] -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - vpc_endpoint_type     = "Interface" -> null
      - vpc_id                = "vpc-07f0c6cefa97a3d8d" -> null
    }

  # module.mcmp.ec_deployment.elastic_cloud["aiops"] will be destroyed
  - resource "ec_deployment" "elastic_cloud" {
      - alias                  = "aiops-cf3705" -> null
      - deployment_template_id = "aws-io-optimized-v2" -> null
      - elasticsearch_password = (sensitive value)
      - elasticsearch_username = "elastic" -> null
      - id                     = "cf3705c15072d3b515c1db14299fdf52" -> null
      - name                   = "aiops" -> null
      - region                 = "aws-ap-south-1" -> null
      - tags                   = {
          - "Environment"      = "dev"
          - "Name"             = "aiops"
          - "environment_type" = "dev"
        } -> null
      - traffic_filter         = [
          - "39d19ba8eaa94599accca244c47d9f5e",
        ] -> null
      - version                = "7.13.4" -> null

      - elasticsearch {
          - autoscale      = "false" -> null
          - cloud_id       = "aiops:YXAtc291dGgtMS5hd3MuZWxhc3RpYy1jbG91ZC5jb206OTI0MyRlN2NiZjQ1OWVhOTI0OGY5OGY2NzFiOGM2YjUyZTYzNiQxOTg1ODJiNjAzNWU0NzY3ODE5OTc5ZmM4OTRkYzEzNg==" -> null
          - http_endpoint  = "http://e7cbf459ea9248f98f671b8c6b52e636.ap-south-1.aws.elastic-cloud.com:9200" -> null
          - https_endpoint = "https://e7cbf459ea9248f98f671b8c6b52e636.ap-south-1.aws.elastic-cloud.com:9243" -> null
          - ref_id         = "main-elasticsearch" -> null
          - region         = "aws-ap-south-1" -> null
          - resource_id    = "e7cbf459ea9248f98f671b8c6b52e636" -> null

          - topology {
              - id                        = "hot_content" -> null
              - instance_configuration_id = "aws.data.highio.i3" -> null
              - node_roles                = [
                  - "data_content",
                  - "data_hot",
                  - "ingest",
                  - "master",
                  - "remote_cluster_client",
                  - "transform",
                ] -> null
              - size                      = "1g" -> null
              - size_resource             = "memory" -> null
              - zone_count                = 2 -> null

              - autoscaling {
                  - max_size          = "32g" -> null
                  - max_size_resource = "memory" -> null
                }
            }

          - trust_account {
              - account_id      = "3476098961" -> null
              - trust_all       = true -> null
              - trust_allowlist = [] -> null
            }
        }

      - kibana {
          - elasticsearch_cluster_ref_id = "main-elasticsearch" -> null
          - http_endpoint                = "http://198582b6035e4767819979fc894dc136.ap-south-1.aws.elastic-cloud.com:9200" -> null
          - https_endpoint               = "https://198582b6035e4767819979fc894dc136.ap-south-1.aws.elastic-cloud.com:9243" -> null
          - ref_id                       = "main-kibana" -> null
          - region                       = "aws-ap-south-1" -> null
          - resource_id                  = "198582b6035e4767819979fc894dc136" -> null

          - topology {
              - instance_configuration_id = "aws.kibana.r5d" -> null
              - size                      = "1g" -> null
              - size_resource             = "memory" -> null
              - zone_count                = 2 -> null
            }
        }
    }

  # module.mcmp.ec_deployment_traffic_filter.traffic_filter[0] will be destroyed
  - resource "ec_deployment_traffic_filter" "traffic_filter" {
      - id                 = "39d19ba8eaa94599accca244c47d9f5e" -> null
      - include_by_default = false -> null
      - name               = "VPC private link" -> null
      - region             = "aws-ap-south-1" -> null
      - type               = "vpce" -> null

      - rule {
          - id     = "820d992ef40e496998822343d0fdf27f" -> null
          - source = "vpce-0df48f07cdb142f99" -> null
        }
    }

  # module.mcmp.module.cloudamqp["actions"].data.template_file.rabbitmq-configuration will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "rabbitmq-configuration"  {
      ~ id       = "8898b31543bcf8892d3177e08c214ac45520b7720fa37ebbc24ac7cc8462e0cd" -> (known after apply)
      ~ rendered = <<-EOT
            #!/bin/bash
            
            log (){
              echo "######## %241 ########"
            }
            
            grant_default_vhost_access() {
              # Granting default Vhost '/' access to Rabbitmq user
              log "Granting default Vhost '/' access to Rabbitmq user"
            
              curl -s --user rkqeefvt:MchNsXzn4fVJUrtxvhIx7QYWu9ZPljsF -XPUT https://cheerful-azure-bulldog.rmq2.cloudamqp.com/api/permissions/%2F/rkqeefvt -d               '{"configure":".","write":".","read":".*"}'               -H 'Content-type: application/json'
            }
            
            _main() {
             grant_default_vhost_access
            }
            
            _main "%24@"
        EOT -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.mcmp.module.cloudamqp["actions"].cloudamqp_security_firewall.firewall_settings will be updated in-place
  ~ resource "cloudamqp_security_firewall" "firewall_settings" {
        id          = "140214"
        # (1 unchanged attribute hidden)

      + rules {
          + description = "Public access for local script exec"
          + ip          = "52.226.64.90/32"
          + ports       = [
              + 15672,
            ]
          + services    = [
              + "HTTPS",
            ]
        }
      - rules {
          - description = "Public access for local script exec" -> null
          - ip          = "59.95.53.18/32" -> null
          - ports       = [
              - 15672,
            ] -> null
          - services    = [
              - "HTTPS",
            ] -> null
        }
        # (1 unchanged block hidden)
    }

  # module.mcmp.module.cloudamqp["coreplus"].data.template_file.rabbitmq-configuration will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "rabbitmq-configuration"  {
      ~ id       = "282fcb85ea993df8e1c7891ab6d6c4dd558e91b20a659c0a313d008d34561849" -> (known after apply)
      ~ rendered = <<-EOT
            #!/bin/bash
            
            log (){
              echo "######## %241 ########"
            }
            
            grant_default_vhost_access() {
              # Granting default Vhost '/' access to Rabbitmq user
              log "Granting default Vhost '/' access to Rabbitmq user"
            
              curl -s --user gkqakhsd:NJogLQsZVxeD_O9whoKSaAhEKUYbVPvN -XPUT https://merry-azure-crab.rmq2.cloudamqp.com/api/permissions/%2F/gkqakhsd -d               '{"configure":".","write":".","read":".*"}'               -H 'Content-type: application/json'
            }
            
            _main() {
             grant_default_vhost_access
            }
            
            _main "%24@"
        EOT -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.mcmp.module.cloudamqp["coreplus"].cloudamqp_security_firewall.firewall_settings will be updated in-place
  ~ resource "cloudamqp_security_firewall" "firewall_settings" {
        id          = "140227"
        # (1 unchanged attribute hidden)

      + rules {
          + description = "Public access for local script exec"
          + ip          = "52.226.64.90/32"
          + ports       = [
              + 15672,
            ]
          + services    = [
              + "HTTPS",
            ]
        }
      - rules {
          - description = "Public access for local script exec" -> null
          - ip          = "59.95.53.18/32" -> null
          - ports       = [
              - 15672,
            ] -> null
          - services    = [
              - "HTTPS",
            ] -> null
        }
        # (1 unchanged block hidden)
    }

  # module.mcmp.module.elastic_cloud.data.aws_route53_zone.internal[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_route53_zone" "internal"  {
      + caller_reference           = (known after apply)
      + comment                    = (known after apply)
      + id                         = (known after apply)
      + linked_service_description = (known after apply)
      + linked_service_principal   = (known after apply)
      + name                       = "vpce.ap-south-1.aws.elastic-cloud.com"
      + name_servers               = (known after apply)
      + private_zone               = true
      + resource_record_set_count  = (known after apply)
      + tags                       = (known after apply)
      + vpc_id                     = "vpc-07f0c6cefa97a3d8d"
      + zone_id                    = (known after apply)
    }

  # module.mcmp.module.elastic_cloud.data.ec_deployment.elastic_cloud["aiops"] will be read during apply
  # (config refers to values not yet known)
 <= data "ec_deployment" "elastic_cloud"  {
      + alias                  = (known after apply)
      + apm                    = (known after apply)
      + deployment_template_id = (known after apply)
      + elasticsearch          = (known after apply)
      + enterprise_search      = (known after apply)
      + healthy                = (known after apply)
      + id                     = (known after apply)
      + kibana                 = (known after apply)
      + name                   = (known after apply)
      + observability          = (known after apply)
      + region                 = (known after apply)
      + tags                   = (known after apply)
      + traffic_filter         = (known after apply)

      + timeouts {
          + default = (known after apply)
        }
    }

  # module.mcmp.module.elastic_cloud.aws_route53_record.elastic_cloud_service[0] will be created
  + resource "aws_route53_record" "elastic_cloud_service" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.vpce.ap-south-1.aws.elastic-cloud.com"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # module.mcmp.module.elastic_cloud.aws_route53_zone.internal[0] will be created
  + resource "aws_route53_zone" "internal" {
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "vpce.ap-south-1.aws.elastic-cloud.com"
      + name_servers  = (known after apply)
      + tags_all      = (known after apply)
      + zone_id       = (known after apply)

      + vpc {
          + vpc_id     = "vpc-07f0c6cefa97a3d8d"
          + vpc_region = (known after apply)
        }
    }

  # module.mcmp.module.elastic_cloud.aws_vpc_endpoint.elastic_cloud[0] will be created
  + resource "aws_vpc_endpoint" "elastic_cloud" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-0e0f17d8e1a44e39c",
        ]
      + service_name          = "com.amazonaws.vpce.ap-south-1.vpce-svc-0e9c1ae5caa269d1b"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-010d6b7a25c1ff310",
          + "subnet-05e50110900d875b5",
          + "subnet-0616185cc57a2e83e",
        ]
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-07f0c6cefa97a3d8d"
    }

  # module.mcmp.module.elastic_cloud.ec_deployment.elastic_cloud["aiops"] will be created
  + resource "ec_deployment" "elastic_cloud" {
      + alias                  = (known after apply)
      + apm_secret_token       = (sensitive value)
      + deployment_template_id = "aws-io-optimized-v2"
      + elasticsearch_password = (sensitive value)
      + elasticsearch_username = (known after apply)
      + id                     = (known after apply)
      + name                   = "mumbai-dev-39e419-aiops"
      + region                 = "aws-ap-south-1"
      + tags                   = {
          + "Environment"      = "dev"
          + "Name"             = "mumbai-dev-39e419-aiops"
          + "environment_type" = "dev"
        }
      + traffic_filter         = (known after apply)
      + version                = "7.13.4"

      + elasticsearch {
          + autoscale      = "false"
          + cloud_id       = (known after apply)
          + http_endpoint  = (known after apply)
          + https_endpoint = (known after apply)
          + ref_id         = "main-elasticsearch"
          + region         = (known after apply)
          + resource_id    = (known after apply)

          + topology {
              + id                        = "hot_content"
              + instance_configuration_id = (known after apply)
              + node_roles                = (known after apply)
              + node_type_data            = (known after apply)
              + node_type_ingest          = (known after apply)
              + node_type_master          = (known after apply)
              + node_type_ml              = (known after apply)
              + size                      = "1g"
              + size_resource             = "memory"
              + zone_count                = (known after apply)

              + autoscaling {
                  + max_size             = "32g"
                  + max_size_resource    = (known after apply)
                  + min_size             = (known after apply)
                  + min_size_resource    = (known after apply)
                  + policy_override_json = (known after apply)
                }
            }

          + trust_account {
              + account_id      = (known after apply)
              + trust_all       = (known after apply)
              + trust_allowlist = (known after apply)
            }

          + trust_external {
              + relationship_id = (known after apply)
              + trust_all       = (known after apply)
              + trust_allowlist = (known after apply)
            }
        }

      + kibana {
          + elasticsearch_cluster_ref_id = "main-elasticsearch"
          + http_endpoint                = (known after apply)
          + https_endpoint               = (known after apply)
          + ref_id                       = "main-kibana"
          + region                       = (known after apply)
          + resource_id                  = (known after apply)

          + topology {
              + instance_configuration_id = (known after apply)
              + size                      = "1g"
              + size_resource             = "memory"
              + zone_count                = 2
            }
        }
    }

  # module.mcmp.module.elastic_cloud.ec_deployment_traffic_filter.traffic_filter[0] will be created
  + resource "ec_deployment_traffic_filter" "traffic_filter" {
      + id                 = (known after apply)
      + include_by_default = false
      + name               = "VPC private link"
      + region             = "aws-ap-south-1"
      + type               = "vpce"

      + rule {
          + id     = (known after apply)
          + source = (known after apply)
        }
    }

Plan: 5 to add, 2 to change, 5 to destroy.

Changes to Outputs:
  ~ mcmp_module_outputs = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

  
 ```
 
</details> 